bug.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Bug List</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">Bug List</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb6a7f6">1. Bug List</a>
<ul>
<li><a href="#org3108686">1.1. <span class="done DONE">DONE</span> mac install Mysql-python</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb6a7f6" class="outline-2">
<h2 id="orgcb6a7f6"><span class="section-number-2">1</span> Bug List</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3108686" class="outline-3">
<h3 id="org3108686"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> mac install Mysql-python</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-12-28 Fri 19:00]</span></span><br></li>
</ul>
<blockquote>
<p>
DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-28 Fri 18:00&gt;</span></span><br>
</p>

<p>
<b>pip install mysql-python fails with EnvironmentError: mysql_config not found</b><br>
</p>

<p>
<b>_mysql.c:44:10: fatal error: 'my_config.h' file not found</b><br>
</p>

<p>
<a href="https://stackoverflow.com/questions/50864438/mac-pip-install-mysql-python-unsuccessful">https://stackoverflow.com/questions/50864438/mac-pip-install-mysql-python-unsuccessful</a><br>
</p>

<p>
Installing of an older version of the MySQL worked for me:<br>
</p>

<p>
brew remove mysql<br>
brew install mysql@5.7<br>
brew link &#x2013;force mysql@5.7<br>
pip install mysql-python<br>
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>